# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
arr=np.array([1,2,3,4,5,6,7,8,9])
arr

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [3]:
data=pd.Series(arr)
data

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [4]:
data=pd.DataFrame(arr, index=['A','B','C','D','E','F','G','H','I'], columns=['Number'])
data

   Number
A       1
B       2
C       3
D       4
E       5
F       6
G       7
H       8
I       9

In [5]:
data={'A': ['Deepak','25','Cloud Support Engineer'],'B':['Ayushi','24','Developer']}

In [6]:
data

{'A': ['Deepak', '25', 'Cloud Support Engineer'],
 'B': ['Ayushi', '24', 'Developer']}

In [7]:
s=pd.Series(data)
s

A    [Deepak, 25, Cloud Support Engineer]
B                 [Ayushi, 24, Developer]
dtype: object

In [8]:
s=np.array(s)
s

array([list(['Deepak', '25', 'Cloud Support Engineer']),
       list(['Ayushi', '24', 'Developer'])], dtype=object)

In [9]:
s=pd.DataFrame(data, columns=['Name','Age','Profession'])
s

Empty DataFrame
Columns: [Name, Age, Profession]
Index: []

In [10]:
a = pd.DataFrame(data)

In [11]:
a

                        A          B
0                  Deepak     Ayushi
1                      25         24
2  Cloud Support Engineer  Developer

In [12]:
a[:1]

        A       B
0  Deepak  Ayushi

In [13]:
a[:3]

                        A          B
0                  Deepak     Ayushi
1                      25         24
2  Cloud Support Engineer  Developer

In [14]:
a[2:3]

                        A          B
2  Cloud Support Engineer  Developer

###### --------------------------------------

In [15]:
data={'Name':['Deepak','Rekha','Kanchan','Sudhir','Doman'],'Age':[25,26,24,28,54],'Subject':['IP','Commerce','Arts','Maths','Bio']}
data

{'Name': ['Deepak', 'Rekha', 'Kanchan', 'Sudhir', 'Doman'],
 'Age': [25, 26, 24, 28, 54],
 'Subject': ['IP', 'Commerce', 'Arts', 'Maths', 'Bio']}

In [16]:
data=np.array(data)
data

array({'Name': ['Deepak', 'Rekha', 'Kanchan', 'Sudhir', 'Doman'], 'Age': [25, 26, 24, 28, 54], 'Subject': ['IP', 'Commerce', 'Arts', 'Maths', 'Bio']},
      dtype=object)

In [17]:
data=np.array(data).reshape(1,1)
data

array([[{'Name': ['Deepak', 'Rekha', 'Kanchan', 'Sudhir', 'Doman'], 'Age': [25, 26, 24, 28, 54], 'Subject': ['IP', 'Commerce', 'Arts', 'Maths', 'Bio']}]],
      dtype=object)

In [18]:
data=pd.DataFrame(data)
data

                                                   0
0  {'Name': ['Deepak', 'Rekha', 'Kanchan', 'Sudhi...

In [19]:
data

                                                   0
0  {'Name': ['Deepak', 'Rekha', 'Kanchan', 'Sudhi...

In [20]:
data=np.array(data)

In [21]:
data

array([[{'Name': ['Deepak', 'Rekha', 'Kanchan', 'Sudhir', 'Doman'], 'Age': [25, 26, 24, 28, 54], 'Subject': ['IP', 'Commerce', 'Arts', 'Maths', 'Bio']}]],
      dtype=object)

In [22]:
data=np.transpose(data)

In [23]:
data

array([[{'Name': ['Deepak', 'Rekha', 'Kanchan', 'Sudhir', 'Doman'], 'Age': [25, 26, 24, 28, 54], 'Subject': ['IP', 'Commerce', 'Arts', 'Maths', 'Bio']}]],
      dtype=object)

In [24]:
data=pd.DataFrame(data)

In [25]:
data

                                                   0
0  {'Name': ['Deepak', 'Rekha', 'Kanchan', 'Sudhi...

In [26]:
data

                                                   0
0  {'Name': ['Deepak', 'Rekha', 'Kanchan', 'Sudhi...

In [27]:
data={'Name': ['Deepak','Ayushi'], 'Age':[25,24], 'Subject':['IP','PE']}
data

{'Name': ['Deepak', 'Ayushi'], 'Age': [25, 24], 'Subject': ['IP', 'PE']}

In [28]:
data=pd.Series(data)
data

Name       [Deepak, Ayushi]
Age                [25, 24]
Subject            [IP, PE]
dtype: object

In [29]:
data=pd.DataFrame(data)
data

                        0
Name     [Deepak, Ayushi]
Age              [25, 24]
Subject          [IP, PE]

In [30]:
data={'Name': ['Deepak','Ayushi'], 'Age':[25,24], 'Subject':['IP','PE']}
data

{'Name': ['Deepak', 'Ayushi'], 'Age': [25, 24], 'Subject': ['IP', 'PE']}

In [31]:
data=np.array(data)
data

array({'Name': ['Deepak', 'Ayushi'], 'Age': [25, 24], 'Subject': ['IP', 'PE']},
      dtype=object)

In [34]:
aa = np.array([[1,2,3,4],[5,6,7,8]])
aa

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [36]:
aa = pd.DataFrame(aa)
aa

   0  1  2  3
0  1  2  3  4
1  5  6  7  8